//mod 14 mod 5 = 4
//div 14 div 5 = 2

//int number = 251;

//int a = number / 10;
//int b = number / 10 % 10;
//int c = number / 100;
//int d = number % 100;

//Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.

int number = 918;

int b = number / 10 % 10;

Console.WriteLine(b);